{	
    "about": "Hi there, my name is Michelle Wong and this is my website! I graduated from the University of Toronto focusing in Computer Science and Mathematics. I am passionate in developing my software skills, and also helping others! My hobbies include mahjong, rhythm games, and custom workspaces.\n\nYou can contact me at: chellewsa@gmail.com",
    "discordbot": "This is my discord bot",
    "project_list": [
		{
			"name": "Granblue API",
		   	"dev_cycle": "2020-2022",
		   	"link": "https://www.google.ca",
			"priority": 1,
		   	"desc": "An API project to provide data about the video game 'Granblue Fantasy' so that others can call it instead of having to source the data again. It also serves as a way for me to modularize data and make my own frontend to showcase data for my own community within the game."
	   	},
		{
			"name": "DDR Leaderboard Web App",
			"dev_cycle": "October 2022",
			"link": "https://yuni-verse.xyz",
			"priority": 2,
			"desc": "A website that displays a leaderboard where data is stored on Google Sheets. Made in 1 week! Hosted with App Engine using Google Cloud."
		},
		{
			"name": "Discord Bot",
			"dev_cycle": "2018-2020",
			"technology": ["Javascript"],
			"link": "https://github.com/miiwo/UOFTDiscordBot",
			"desc": "This Discord bot was made to make displaying course descriptions and shuttle bus times in a cleaner and accessible format to students. It used Cobalt API, an API made by other UoFT students to fetch the data."
		},
		{
			"name": "DDR Scores Tracker",
			"dev_cycle": "2019-2020",
			"link": "https://github.com/miiwo/DDRSnapshot",
			"desc": "A mobile app that tracks scores on the go when playing the commercial arcade game 'Dance Dance Revolution'. I've been meaning to have a portable way of keeping track of my scores, and the sentiment goes to a bunch of others who play it. There are a couple of apps for this out already but I also wanted to have an AI function to it since the break time between songs is very short, inputting info needs to be done fast and simple. Frontend is using Xamarin UI framework. On the backend, AWS is used to image analyze photos and Realm as an offline database."
		},
		{
			"name": "Filename Scrambler",
			"dev_cycle": "2019",
			"link": "https://github.com/miiwo/filescrambler",
			"desc": "Small little bash script I wrote that alphanumerically scrambles the names of files in a folder. This was used to help manage my background image names by making them anonymous."
		},
		{
			"name": "Personal Website",
			"dev_cycle": "2017-2022",
			"technology": ["React", "HTML", "CSS"],
			"link": "https:///github.com/miiwo/miiwo.github.io",
			"desc": "This site your reading right now! I've been maintaining this personal website throughout the years. At first, it was created with only HTML and CSS. It's evolved to use React as a front-end framework to maintain modular components for reuse in other web projects and/or extensions to this website. This website also contains a link to a start page that I use on a daily basis."
		}
		],
    "bookmark_one": {
		"Github": "www.github.ca",
		"HackerRank": "hackerrank.com"
    },
    "bookmark_two": {
		"Twitter": "www.twitter.com",
		"RedFlagDeals": "www.redflagdeals.ca"
    },
    "bookmark_three": {
		"unix aesthetics": "www.reddit.com/r/unixporn",
		"keyboards": "www.reddit.com/r/keyboards"
    }
    
}
    

